nguyentri/da-pac/svd/DA14582.svd
<?xml version="1.0" encoding="ascii"?>
<!-- File naming: Dialog_DA14581a0m2_x_nl1_4.svd -->
<!--
  Copyright (C) 2018 Dialog Semiconductor.
  This computer program includes Confidential, Proprietary Information  
  of Dialog Semiconductor. All Rights Reserved.

  Purpose: System Viewer Description (SVD) Example (Schema Version 1.1)
           This is a description of a none-existent and incomplete device
		   for demonstration purposes only.

  Generated by cmsis-svd (version 0.2), d.d. September 03, 2018 - 16:09:04
 -->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <vendor>Dialog</vendor>                   				    <!-- device vendor name -->
  <vendorID>ARM</vendorID>                                        <!-- device vendor short name -->
  <name>DA14582</name>                                          <!-- name of part-->
  <series>DA1458x</series>                                         <!-- device series the device belongs to -->
  <description>Ultra-Low power Bleutooth 4.2 SoC with Audio codec from Dialog Semiconductor</description>
  <version>1.2</version>                                          <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
  
  <licenseText><!-- this license text will appear in header file. \n forces line breaks -->
    Copyright (C) 2018 Dialog Semiconductor.\n
    This computer program includes Confidential, Proprietary Information  \n
    of Dialog Semiconductor. All Rights Reserved. \n
    \n
    Dialog GmbH (DLG) is supplying this software for use with Cortex-M\n
    processor based microcontroller, but can be equally used for other\n
    suitable  processor architectures. This file can be freely distributed.\n
    Modifications to this file shall be clearly marked.\n
    \n
    THIS SOFTWARE IS PROVIDED  AS IS .  NO WARRANTIES, WHETHER EXPRESS, IMPLIED\n
    OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF\n
    MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.\n
    ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR\n
    CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.

</licenseText>
  <cpu><!-- details about the cpu embedded in the device (SVD version 1.2,  see https://www.keil.com/pack/doc/CMSIS/SVD/html/group__cpu_section__gr.html) -->
    <name>CM0</name>
    <revision>r1p0</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
		
  </cpu>
  <addressUnitBits>8</addressUnitBits>                            <!-- byte addressable memory -->
  <width>32</width>                                               <!-- bus width is 32 bits -->
  <!-- default settings implicitly inherited by subsequent sections -->
  <size>32</size>                                                 <!-- this is the default size (number of bits) of all peripherals
																																									 and register that do not define "size" themselves -->
  <access>read-write</access>                                     <!-- default access permission for all subsequent registers -->
  <resetValue>0x00000000</resetValue>                             <!-- by default all bits of the registers are initialized to 0 on reset -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- by default all 32Bits of the registers are used -->
	
  <peripherals>
	<peripheral>  
  <name>NVIC</name>
  <version>1.0</version>
  <description>Cortex M0 NVIC registers</description>
  <groupName>NVIC_GROUP</groupName>
  <baseAddress>0xE000E100</baseAddress>
  <size>0</size>
  <addressBlock>
		<offset>0</offset>
		<size>0x321</size>
		<usage>registers</usage>
  </addressBlock>
  <registers>
	<register>
	  <name>ISER</name>
	  <description>Interrupt set-enable register</description>
	  <addressOffset>0x00000000</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>BLE_WAKEUP_LP_IRQn</name>
		  <description>BLE_WAKEUP_LP_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[0:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_GEN_IRQn</name>
		  <description>BLE_GEN_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[1:1]</bitRange>
		  <access>read-write</access>
		</field>
  		<field>
		  <name>UART_IRQn</name>
		  <description>UART_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[2:2]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART2_IRQn</name>
		  <description>UART2_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[3:3]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C_IRQn</name>
		  <description>I2C_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[4:4]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI_IRQn</name>
		  <description>SPI_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[5:5]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>ADC_IRQn</name>
		  <description>ADC_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[6:6]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>KEYBRD_IRQn</name>
		  <description>KEYBRD_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[7:7]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_RF_DIAG_IRQn</name>
		  <description>BLE baseband or Radio diagnostic (Interrupt set-enable bit))</description>
		  <bitRange>[8:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RFCAL_IRQn</name>
		  <description>RFCAL_IRQn (Interrupt set-enable bit)</description>
		  <bitRange>[9:9]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO0_IRQn</name>
          <description>GPIO0 interrupt through debounce (Interrupt set-enable bit)</description>
		  <bitRange>[10:10]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO1_IRQn</name>
		  <description>GPIO1 interrupt through debounce (Interrupt set-enable bit)</description>
		  <bitRange>[11:11]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO2_IRQn</name>
		  <description>GPIO2 interrupt through debounce (Interrupt set-enable bit)</description>
		  <bitRange>[12:12]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO3_IRQn</name>
		  <description>IGPIO3 interrupt through debounce (Interrupt set-enable bit)</description>
		  <bitRange>[13:13]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO4_IRQn</name>
		  <description>GPIO4 interrupt through debounce (Interrupt set-enable bit)</description>
		  <bitRange>[14:14]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM_IRQn</name>
		  <description>Software timer Interrupt (set-enable bit)</description>
		  <bitRange>[15:15]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>WKUP_QUADEC_IRQn</name>
		  <description>Combined Wake up Capture Timer, GPIO and QuadDecoder interrupt (set-enable bit)</description>
		  <bitRange>[16:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PCM_IRQn</name>
		  <description>PCM Interrupt (set-enable bit)</description>
		  <bitRange>[17:17]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_IN_IRQn</name>
		  <description>Sample rate converter input Interrupt (set-enable bit)</description>
		  <bitRange>[18:18]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_OUT_IRQn</name>
		  <description>Sample rate converter output Interrupt (set-enable bit)</description>
		  <bitRange>[19:19]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DMA_IRQn</name>
		  <description>DMA Interrupt (set-enable bit)</description>
		  <bitRange>[20:20]</bitRange>
		  <access>read-write</access>
		</field>
      </fields>
	</register>
	<register>
	  <name>ICER</name>
	  <description>Interrupt clear-enable register</description>
	  <addressOffset>0x00000080</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>BLE_WAKEUP_LP_IRQn</name>
		  <description>BLE_WAKEUP_LP_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[0:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_GEN_IRQn</name>
		  <description>BLE_GEN_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[1:1]</bitRange>
		  <access>read-write</access>
		</field>
  		<field>
		  <name>UART_IRQn</name>
		  <description>UART_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[2:2]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART2_IRQn</name>
		  <description>UART2_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[3:3]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C_IRQn</name>
		  <description>I2C_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[4:4]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI_IRQn</name>
		  <description>SPI_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[5:5]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>ADC_IRQn</name>
		  <description>ADC_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[6:6]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>KEYBRD_IRQn</name>
		  <description>KEYBRD_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[7:7]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_RF_DIAG_IRQn</name>
		  <description>BLE baseband or Radio diagnostic (Interrupt clear-enable bit))</description>
		  <bitRange>[8:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RFCAL_IRQn</name>
		  <description>RFCAL_IRQn (Interrupt clear-enable bit)</description>
		  <bitRange>[9:9]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO0_IRQn</name>
          <description>GPIO0 interrupt through debounce (Interrupt clear-enable bit)</description>
		  <bitRange>[10:10]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO1_IRQn</name>
		  <description>GPIO1 interrupt through debounce (Interrupt clear-enable bit)</description>
		  <bitRange>[11:11]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO2_IRQn</name>
		  <description>GPIO2 interrupt through debounce (Interrupt clear-enable bit)</description>
		  <bitRange>[12:12]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO3_IRQn</name>
		  <description>IGPIO3 interrupt through debounce (Interrupt clear-enable bit)</description>
		  <bitRange>[13:13]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO4_IRQn</name>
		  <description>GPIO4 interrupt through debounce (Interrupt clear-enable bit)</description>
		  <bitRange>[14:14]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM_IRQn</name>
		  <description>Software timer Interrupt (clear-enable bit)</description>
		  <bitRange>[15:15]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>WKUP_QUADEC_IRQn</name>
		  <description>Combined Wake up Capture Timer, GPIO and QuadDecoder interrupt (clear-enable bit)</description>
		  <bitRange>[16:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PCM_IRQn</name>
		  <description>PCM Interrupt (clear-enable bit)</description>
		  <bitRange>[17:17]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_IN_IRQn</name>
		  <description>Sample rate converter input Interrupt (clear-enable bit)</description>
		  <bitRange>[18:18]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_OUT_IRQn</name>
		  <description>Sample rate converter output Interrupt (clear-enable bit)</description>
		  <bitRange>[19:19]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DMA_IRQn</name>
		  <description>DMA Interrupt (clear-enable bit)</description>
		  <bitRange>[20:20]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>ISPR</name>
	  <description>Interrupt set-pending register</description>
	  <addressOffset>0x00000100</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>BLE_WAKEUP_LP_IRQn</name>
		  <description>BLE_WAKEUP_LP_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[0:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_GEN_IRQn</name>
		  <description>BLE_GEN_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[1:1]</bitRange>
		  <access>read-write</access>
		</field>
  		<field>
		  <name>UART_IRQn</name>
		  <description>UART_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[2:2]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART2_IRQn</name>
		  <description>UART2_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[3:3]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C_IRQn</name>
		  <description>I2C_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[4:4]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI_IRQn</name>
		  <description>SPI_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[5:5]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>ADC_IRQn</name>
		  <description>ADC_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[6:6]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>KEYBRD_IRQn</name>
		  <description>KEYBRD_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[7:7]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_RF_DIAG_IRQn</name>
		  <description>BLE baseband or Radio diagnostic (Interrupt set-pending bit))</description>
		  <bitRange>[8:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RFCAL_IRQn</name>
		  <description>RFCAL_IRQn (Interrupt set-pending bit)</description>
		  <bitRange>[9:9]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO0_IRQn</name>
          <description>GPIO0 interrupt through debounce (Interrupt set-pending bit)</description>
		  <bitRange>[10:10]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO1_IRQn</name>
		  <description>GPIO1 interrupt through debounce (Interrupt set-pending bit)</description>
		  <bitRange>[11:11]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO2_IRQn</name>
		  <description>GPIO2 interrupt through debounce (Interrupt set-pending bit)</description>
		  <bitRange>[12:12]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO3_IRQn</name>
		  <description>IGPIO3 interrupt through debounce (Interrupt set-pending bit)</description>
		  <bitRange>[13:13]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO4_IRQn</name>
		  <description>GPIO4 interrupt through debounce (Interrupt set-pending bit)</description>
		  <bitRange>[14:14]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM_IRQn</name>
		  <description>Software timer Interrupt (set-pending bit)</description>
		  <bitRange>[15:15]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>WKUP_QUADEC_IRQn</name>
		  <description>Combined Wake up Capture Timer, GPIO and QuadDecoder interrupt (set-pending bit)</description>
		  <bitRange>[16:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PCM_IRQn</name>
		  <description>PCM Interrupt (set-pending bit)</description>
		  <bitRange>[17:17]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_IN_IRQn</name>
		  <description>Sample rate converter input Interrupt (set-pending bit)</description>
		  <bitRange>[18:18]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_OUT_IRQn</name>
		  <description>Sample rate converter output Interrupt (set-pending bit)</description>
		  <bitRange>[19:19]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DMA_IRQn</name>
		  <description>DMA Interrupt (set-pending bit)</description>
		  <bitRange>[20:20]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>ICPR</name>
	  <description>Interrupt clear-pending register</description>
	  <addressOffset>0x00000180</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>BLE_WAKEUP_LP_IRQn</name>
		  <description>BLE_WAKEUP_LP_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[0:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_GEN_IRQn</name>
		  <description>BLE_GEN_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[1:1]</bitRange>
		  <access>read-write</access>
		</field>
  		<field>
		  <name>UART_IRQn</name>
		  <description>UART_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[2:2]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART2_IRQn</name>
		  <description>UART2_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[3:3]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C_IRQn</name>
		  <description>I2C_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[4:4]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI_IRQn</name>
		  <description>SPI_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[5:5]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>ADC_IRQn</name>
		  <description>ADC_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[6:6]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>KEYBRD_IRQn</name>
		  <description>KEYBRD_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[7:7]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_RF_DIAG_IRQn</name>
		  <description>BLE baseband or Radio diagnostic (Interrupt clear-pending bit))</description>
		  <bitRange>[8:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RFCAL_IRQn</name>
		  <description>RFCAL_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[9:9]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO0_IRQn</name>
          <description>GPIO0 interrupt through debounce (Interrupt clear-pending bit)</description>
		  <bitRange>[10:10]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO1_IRQn</name>
		  <description>GPIO1 interrupt through debounce (Interrupt clear-pending bit)</description>
		  <bitRange>[11:11]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO2_IRQn</name>
		  <description>GPIO2 interrupt through debounce (Interrupt clear-pending bit)</description>
		  <bitRange>[12:12]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO3_IRQn</name>
		  <description>IGPIO3 interrupt through debounce (Interrupt clear-pending bit)</description>
		  <bitRange>[13:13]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>GPIO4_IRQn</name>
		  <description>GPIO4 interrupt through debounce (Interrupt clear-pending bit)</description>
		  <bitRange>[14:14]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM_IRQn</name>
		  <description>Software timer Interrupt (clear-pending bit)</description>
		  <bitRange>[15:15]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>WKUP_QUADEC_IRQn</name>
		  <description>Combined Wake up Capture Timer, GPIO and QuadDecoder interrupt (clear-pending bit)</description>
		  <bitRange>[16:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PCM_IRQn</name>
		  <description>PCM Interrupt (clear-pending bit)</description>
		  <bitRange>[17:17]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_IN_IRQn</name>
		  <description>Sample rate converter input Interrupt (clear-pending bit)</description>
		  <bitRange>[18:18]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_OUT_IRQn</name>
		  <description>Sample rate converter output Interrupt (clear-pending bit)</description>
		  <bitRange>[19:19]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DMA_IRQn</name>
		  <description>DMA Interrupt (clear-pending bit)</description>
		  <bitRange>[20:20]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>IPR0</name>
	  <description>Interrupt priority register 0</description>
	  <addressOffset>0x00000300</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>BLE_WAKEUP_LP_IRQn_prio</name>
		  <description>BLE_WAKEUP_LP_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[7:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_GEN_IRQn_prio</name>
		  <description>BLE_GEN_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[15:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART_IRQn_prio</name>
		  <description>UART_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[23:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART2_IRQn_prio</name>
		  <description>UART2_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[31:24]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>IPR1</name>
	  <description>Interrupt priority register 1</description>
	  <addressOffset>0x00000304</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>I2C_IRQn_prio</name>
		  <description>I2C_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[7:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI_IRQn_prio</name>
		  <description>SPI_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[15:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>ADC_IRQn_prio</name>
		  <description>ADC_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[23:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>KEYBRD_IRQn_prio</name>
		  <description>KEYBRD_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[31:24]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
