nguyentri/da-pac/svd/DA14582.svd
  </registers>
</peripheral><peripheral>
  <name>SysTick</name>
  <version>1.0</version>
  <description>Cortex M0 SysTick registers</description>
  <groupName>SYSTICK</groupName>
  <baseAddress>0xE000E010</baseAddress>
  <size>0</size>
  <addressBlock>
		<offset>0</offset>
		<size>0x11</size>
		<usage>registers</usage>
  </addressBlock>
  <registers>
	<register>
	  <name>CTRL</name>
	  <description>SysTick Control and Status register</description>
	  <addressOffset>0x00000000</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000004</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>ENABLE</name>
		  <description>SysTick Counter enable</description>
		  <bitRange>[0:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>TICKINT</name>
		  <description>SysTick exception request enable</description>
		  <bitRange>[1:1]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>CLKSOURCE</name>
		  <description>Clock source selection</description>
		  <bitRange>[2:2]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>COUNTFLAG</name>
		  <description>Timer counted to 0 since last time this was read</description>
		  <bitRange>[16:16]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>LOAD</name>
	  <description>SysTick Reload value register</description>
	  <addressOffset>0x00000004</addressOffset>
	  <size>32</size>
	  <access>read-write<!--==(HARDCODED)==--></access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>RELOAD</name>
		  <description>RELOAD[23:0] bits (Reload value)</description>
		  <bitRange>[23:0]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>VAL</name>
	  <description>SysTick Current value register</description>
	  <addressOffset>0x00000008</addressOffset>
	  <size>32</size>
	  <access>read-write<!--==(HARDCODED)==--></access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>CURRENT</name>
		  <description>CURRENT[23:0] bits (Current counter value)</description>
		  <bitRange>[23:0]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>CALIB</name>
	  <description>SysTick Calibration value register</description>
	  <addressOffset>0x0000000C</addressOffset>
	  <size>32</size>
	  <access>read-only<!--==(HARDCODED)==--></access>
	  <resetValue>0x00002328</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>TENMS</name>
		  <description>TENMS[23:0] bits (Calibration value)</description>
		  <bitRange>[23:0]</bitRange>
		  <access>read-only</access>
		</field>
		<field>
		  <name>SKEW</name>
		  <description>Indicates whether the TENMS value is exact</description>
		  <bitRange>[30:30]</bitRange>
		  <access>read-only</access>
		</field>
		<field>
		  <name>NOREF</name>
		  <description>Indicates that a separate reference clock is provided</description>
		  <bitRange>[31:31]</bitRange>
		  <access>read-only</access>
		</field>
	  </fields>
	</register>
  </registers>
</peripheral><peripheral>
	<name>adc580_bif_nl01</name>
	<version>1.0</version>
	<description>adc580_bif_nl01 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50001500</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>16</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>GP_ADC_CLEAR_INT_REG</name>
	<description>General Purpose ADC Clear Interrupt Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>GP_ADC_CLR_INT</name>
	<description>Writing any value to this register will clear the ADC_INT interrupt. Reading returns 0. </description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>GP_ADC_CTRL2_REG</name>
	<description>General Purpose ADC Second Control Register</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>GP_ADC_I20U</name>
	<description>Adds 20uA constant load current at the ADC LDO to minimize ripple on the reference voltage of the ADC. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_IDYN</name>
	<description>Enables dynamic load current at the ADC LDO to minimize ripple on the reference voltage of the ADC. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_ATTN3X</name>
	<description>0 = Input voltages up to 1.2V allowed.
1 = Input voltages up to 3.6V allowed by enabling 3x attenuator. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_DELAY_EN</name>
	<description>Enables delay function for several signals. This is not auto-cleared. Toggle this bit before every sampling to enable succesive conversions.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>GP_ADC_CTRL_REG</name>
	<description>General Purpose ADC Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>GP_ADC_LDO_ZERO</name>
	<description>Forces LDO-output to 0V. </description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_LDO_EN</name>
	<description>Turns on LDO. </description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_CHOP</name>
	<description>Takes two samples with opposite GP_ADC_SIGN to cancel the internal offset voltage of the ADC; Highly recommended for DC-measurements.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_MUTE</name>
	<description>Takes sample at mid-scale (to dertermine the internal offset and/or noise of the ADC with regards to VDD_REF which is also sampled by the ADC). </description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_SE</name>
	<description>0 = Differential mode
1 = Single ended mode</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_SIGN</name>
	<description>0 = Default
1 = Conversion with opposite sign at input and output to cancel out the internal offset of the ADC and low-frequency </description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_SEL</name>
	<description>ADC input selection which must be set before the GP_ADC_START bit is enabled.
If GP_ADC_SE = 1 (single ended mode):
0000 = P0[0]
0001 = P0[1]
0010 = P0[2]
0011 = P0[3]
0100 = AVS
0101 = VDD_REF
0110 = VDD_RTT (=VDD_REF)
0111 = VBAT3V
1000 = VDCDC
1001 = VBAT1V
All other combinations are reserved.
If GP_ADC_SE = 0 (differential mode):
0000 = P0[0] vs P0[1]
All other combinations are P0[2] vs P0[3].</description>
	<bitRange>[9:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_MINT</name>
	<description>0 = Disable (mask) GP_ADC_INT.
1 = Enable GP_ADC_INT to ICU.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_INT</name>
	<description>1 = AD conversion ready and has generated an interrupt. Must be cleared by writing any value to GP_ADC_CLEAR_INT_REG.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>GP_ADC_CLK_SEL</name>
	<description>0 = Internal high-speed ADC clock used.
1 = Digital clock used. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_TEST</name>
	<description>Reserved, keep 0.</description>
	<bitRange>[2:2]</bitRange>
	
	</field><field>
	<name>GP_ADC_START</name>
	<description>0 = ADC conversion ready.
1 = If a 1 is written, the ADC starts a conversion. After the conversion this bit will be set to 0 and the GP_ADC_INT bit will be set. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_EN</name>
	<description>0 = ADC is disabled and in reset.
1 = ADC is enabled and sampling of input is started. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>GP_ADC_DELAY2_REG</name>
	<description>General Purpose ADC Second Delay Register</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00008880</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DEL_ADC_START</name>
	<description>Defines the delay for the GP_ADC_START bit. Reset value is 17 &#181;s which is the recommended value to wait before starting the GP ADC. This is the third and last step of bringing up the GP ADC</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEL_ADC_EN</name>
	<description>Defines the delay for the GP_ADC_EN bit. Reset value is 16 &#181;s which is the recommended value to wait after enabling the LDO. This is the second step in bringing up the GP ADC.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>GP_ADC_DELAY_REG</name>
	<description>General Purpose ADC Delay Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DEL_LDO_EN</name>
	<description>Defines the delay before the LDO enable (GP_ADC_LDO_EN). Reset value is 0 &#181;s since the LDO enable should be the first thing to be programmed in the sequence of bringing the GP ADC up.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>GP_ADC_OFFN_REG</name>
	<description>General Purpose ADC Negative Offset Register</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>GP_ADC_OFFN</name>
	<description>Offset adjust of 'negative' array of ADC-network (effective if &quot;GP_ADC_SE=0&quot;, or &quot;GP_ADC_SE=1 AND GP_ADC_SIGN=1&quot;)</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>GP_ADC_OFFP_REG</name>
	<description>General Purpose ADC Positive Offset Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>GP_ADC_OFFP</name>
	<description>Offset adjust of 'positive' array of ADC-network (effective if &quot;GP_ADC_SE=0&quot;, or &quot;GP_ADC_SE=1 AND GP_ADC_SIGN=0&quot;)</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>GP_ADC_RESULT_REG</name>
	<description>General Purpose ADC Result Register</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>GP_ADC_VAL</name>
	<description>Returns the 10 bits linear value of the last AD conversion.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>anamisc580_nl01</name>
	<version>1.0</version>
	<description>anamisc580_nl01 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50001600</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>8</size>
	<usage>registers</usage>
</addressBlock>
	
