nguyentri/da-pac/svd/DA14582.svd
	<registers>
	<register>
	<name>OTPC_AHBADR_REG</name>
	<description>AHB master start address</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>OTPC_AHBADR</name>
	<description>Tthe AHB address used by the AHB master interface of the controller (
bits [31:2]). </description>
	<bitRange>[31:2]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>OTPC_CELADR_REG</name>
	<description>Macrocell start address</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>OTPC_CELADR</name>
	<description>Defines a word address inside the macrocell. Used in modes AREAD and APROG and is automatically updated. </description>
	<bitRange>[12:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>OTPC_FFPRT_REG</name>
	<description>Ports access to fifo logic</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>OTPC_FFPRT</name>
	<description>Provides access to the fifo through an access port. Write this register with the corresponding data, when the APROG mode is selected and the DMA is disabled. Read from this register the corresponding data, when the AREAD mode is selected and the DMA is disabled.
Check OTPC_STAT_FWORDS register for data/space availability, before accessing the fifo. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>OTPC_FFRD_REG</name>
	<description>Latest read data from the OTPC_FFPRT_REG</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>OTPC_FFRD</name>
	<description>Contains the value read from the fifo, after a read of the OTPC_FFPRT_REG register. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>OTPC_MODE_REG</name>
	<description>Mode register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>OTPC_MODE_PRG_PORT_MUX</name>
	<description>Selects the source that is connected to the prg_port port of the controller.
00 - {16'd0, BANDGAP_REG[15:0]}
01 - {RF_RSSI_COMP_CTRL_REG[15:0], 8'd0, RFIO_CTRL1_REG{7:0]}
10 - {3'd0, RF_LNA_CTRL3_REG[4:0], RF_LNA_CTRL2_REG[11:0], RF_LNA_CTRL1_REG[11:0]}
11 - {28'd0, RF_VCO_CTRL_REG[3:0]}
See OTPC_MODE_PRG_PORT_SEL about the use of the prg_port </description>
	<bitRange>[29:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OPTC_MODE_PRG_FAST</name>
	<description>Defines the timing that will be used for all the programming activities (APROG, MPROG and TWR)
0 - Selects the normal timing
1 - Selects the fast timing </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_MODE_PRG_PORT_SEL</name>
	<description>Selects an alternative data source for the programming of the OTP macrocells, when the controller is configured in APROG mode.
0 - The fifo will be used as the data source. The fifo will be filled with a way defined by the register OTPC_MODE_USE_DMA. The number of words that will be programmed is defined by OTPC_NWORDS.
1 - Only one word will programmed. The value of the word is contained in the prg_port port of the controller. The values of the registers OTPC_MODE_USE_DMA, OTPC_NWORDS and the contents of the FIFO will not be used. </description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_MODE_TWO_CC_ACC</name>
	<description>Defines the duration of each read from the OTP macrocells.
0 - Reads 16 bits of data every one clock cycle.
1 - Reads 16 bits of data every two clock cycles. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_MODE_FIFO_FLUSH</name>
	<description>Writing 1, removes any content from the FIFO. This bit returns automatically to 0. </description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_MODE_USE_DMA</name>
	<description>Selects the use of the dma, when the controller is configured in one of the modes: AREAD or APROG.
0 - DMAis not used. The data should be transfered from/to controller through OTPC_FFPRT_REG
1 - DMA is used. Data transfers from/to controller are performed automatically. The AHB base address should be configured in OTPC_AHBADR_REG before the selection of the mode.
If programming of the OTPC_MODE_REG is performed through the serial interface,the OTPC_MODE_USE_DMA will be set to 0 automatically.
If the controller is in APROG mode and the OTPC_MODE_PRG_PORT_SEL is enabled, the dma will stay inactive.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_MODE_MODE</name>
	<description>Defines the mode of operation of the OTPC controller. The encoding of the modes is as follows:
000 - STBY mode
001 - MREAD mode
010 - MPROG mode
011 - AREAD mode
100 - APROG mode
101 - Test mode. Reserved
110 - Test mode. Reserved
111 - Test mode. Reserved
To manually move between modes, always return to STBY mode first.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>OTPC_NWORDS_REG</name>
	<description>Number of words</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>OTPC_NWORDS</name>
	<description>The number of words (minus one) for reading/programming during the AREAD/APROG mode.
If in APROG mode, and the OTPC_MODE_PRG_PORT_SEL is enabled (=1), this register will not be used and will stay unchanged.
During mirroring, this register reflects the current amount of data that will be copied. It keeps its value until be written by the software with a new value. The number of the words that remaining to be processed by the controller is contained in the field OTPC_STAT_NWORDS.</description>
	<bitRange>[12:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>OTPC_PCTRL_REG</name>
	<description>Bit-programming control register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>OTPC_PCTRL_ENU</name>
	<description>Enables the programming in the upper bank of the OTP.
0 - Programming sequence is not applied in the upper bank.
1 - Programming sequence is applied in the upper bank. </description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_PCTRL_BITU</name>
	<description>Defines the value of the selected bit in the upper bank, after the programming sequence. </description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_PCTRL_ENL</name>
	<description>Enables the programming in the lower bank.
0 - The programming sequence is not applied in the lower bank.
1 -The programming sequence is applied in the lower bank. </description>
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_PCTRL_BITL</name>
	<description>Defines the value of the selected bit in the lower bank, after the programming sequence. </description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_PCTRL_BSELU</name>
	<description>Selects between the U1 and U0 byte for the programming sequence in the upper bank.
0 - Program the U0 byte
1 - Program the U1 byte -</description>
	<bitRange>[23:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_PCTRL_BADRU</name>
	<description>Selects the bit inside the Ux (x=0,1) byte, which will be programmed in the upper bank. </description>
	<bitRange>[22:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_PCTRL_BSELL</name>
	<description>Selects between the L1 and L0 byte for the programming sequence in the lower bank.
0 - Program the L0 byte
1 - Program the L1 byte </description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_PCTRL_BADRL</name>
	<description>Selects the bit inside the Lx (x=0,1) byte, which will be programmed in the lower bank. </description>
	<bitRange>[18:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTPC_PCTRL_WADDR</name>
	<description>Defines the address of a 32 bits word {U1,L1,U0,L0} in the macrocells, where one or two bits will be programmed. There are two macrocell banks, with 8 bits each. Each bank contribute with two memory positions for each 32 bits word. The Ux, Lx represent the bytes of the upper and lower bank respectively.</description>
	<bitRange>[12:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>OTPC_STAT_REG</name>
	<description>Status register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000015</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>OTPC_STAT_NWORDS</name>
	<description>Contains the current value of the words to be processed.</description>
	<bitRange>[28:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>OTPC_STAT_TERR_U</name>
	<description>Indicates the upper bank as the source of a test error. This value is valid when OTPC_STAT_TERROR is valid.
0 - There is no test error in the upper bank
1 - A test error has occured in the upper bank </description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>OTPC_STAT_TERR_L</name>
	<description>Indicates the lower bank as the source of a test error. The value is valid when OTPC_STAT_TERROR is valid.
0 - There is no test error in the lower bank
1 - A test error has occured in the lower bank </description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>OTPC_STAT_PERR_U</name>
	<description>Indicates the upper bank as the source of a programming error. The value is valid when OTPC_STAT_PERROR is valid.
0 - There is no programming error in the upper bank
1 - A programming error has occured in the upper bank </description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>OTPC_STAT_PERR_L</name>
	<description>Indicates the lower bank as the source of a programming error. The value is valid when OTPC_STAT_PERROR is valid.
0 - There is no programming error in the lower bank
1 - A programming error has occured in the lower bank </description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>OTPC_STAT_FWORDS</name>
	<description>Indicates the number of words which contained in the fifo of the controller. </description>
	<bitRange>[11:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>OTPC_STAT_ARDY</name>
	<description>Monitors the progress of read or programming operations while in the AREAD or APROG modes.
0 - The controller is busy while reading or programming (AREAD or APROG modes).
1 - The controller is not busy in AREAD or APROG mode. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>OTPC_STAT_TERROR</name>
	<description>Indicates the result of a test sequence. Should be checked after the end of a TBLANK, TDEC and TWR mode (OTPC_STAT_TRDY= 1).
0 - The test sequence ends with no error.
1 - The test sequence has failed. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>OTPC_STAT_TRDY</name>
	<description>Indicates the state of a test mode. Should be used to monitor the progress of the TBLANK, TDEC and TWR modes.
0 - The controller is busy. A test mode is in progress.
1 - There is no active test mode. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>OTPC_STAT_PERROR</name>
	<description>Indicates that an error has occurred during the bit-programming process.
0 - No error during the bit-programming process.
1 - The process of bit-programming failed.
When the controller is in MPROG mode, this bit should be checked after the end of the programming process (OTPC_STAT_PRDY= 1).
During APROG mode, the value of this field is normal to change periodically. Upon finishing the operation in the APROG mode (OTPC_STAT_ARDY= 1), this field indicates if the programming has failed or ended succesfully. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>OTPC_STAT_PRDY</name>
	<description>Indicates the state of a bit-programming process.
0 - The controller is busy. A bit-programming is in progress
1 - The logic which performs bit-programming is idle.
When the controller is in MPROG mode, this bit should be used to monitor the progress of a programming request.
During APROG mode, the value of this field it is normal to changing periodically. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>quadec580_gr01</name>
	<version>1.0</version>
	<description>quadec580_gr01 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000200</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>12</size>
	<usage>registers</usage>
</addressBlock>
	
