nguyentri/da-pac/svd/DA14582.svd
</registers>
		<interrupt>
			<name>BLE_WAKEUP_LP</name>
			<description>Wake-up from Low Power (Extended Sleep) interrupt from BLE</description>
			<value>0</value>
		</interrupt>
		<interrupt>
			<name>BLE_GEN</name>
			<description>BLE Interrupt from various BLE sources.</description>
			<value>1</value>
		</interrupt>
		<interrupt>
			<name>UART</name>
			<description>UART interrupt</description>
			<value>2</value>
		</interrupt>
		<interrupt>
			<name>UART2</name>
			<description>UART2 interrupt</description>
			<value>3</value>
		</interrupt>
		<interrupt>
			<name>I2C</name>
			<description>I2C interrupt</description>
			<value>4</value>
		</interrupt>
		<interrupt>
			<name>SPI</name>
			<description>SPI interrupt</description>
			<value>5</value>
		</interrupt>
		<interrupt>
			<name>ADC</name>
			<description>Analog-Digital Converter interrupt.</description>
			<value>6</value>
		</interrupt>
		<interrupt>
			<name>KEYBRD</name>
			<description>Keyboard interrupt.</description>
			<value>7</value>
		</interrupt>
		<interrupt>
			<name>BLE_RF_DIAG</name>
			<description>Baseband or Radio Diagnostics Interrupt</description>
			<value>8</value>
		</interrupt>
		<interrupt>
			<name>RF_CAL</name>
			<description>RF Calibration Interrupt</description>
			<value>9</value>
		</interrupt>
		<interrupt>
			<name>GPIO0</name>
			<description>GPIO0 interrupt through debounce</description>
			<value>10</value>
		</interrupt>
		<interrupt>
			<name>GPIO1</name>
			<description>GPIO1 interrupt through debounce</description>
			<value>11</value>
		</interrupt>
		<interrupt>
			<name>GPIO2</name>
			<description>GPIO2 interrupt through debounce</description>
			<value>12</value>
		</interrupt>
		<interrupt>
			<name>GPIO3</name>
			<description>GPIO3 interrupt through debounce</description>
			<value>13</value>
		</interrupt>
		<interrupt>
			<name>GPIO4</name>
			<description>GPIO4 interrupt through debounce</description>
			<value>14</value>
		</interrupt>
		<interrupt>
			<name>SWTIM</name>
			<description>Software Timer interrupt</description>
			<value>15</value>
		</interrupt>
		<interrupt>
			<name>WKUP_QUADEC</name>
			<description>Combines the Wake up Capture Timer interrupt, the GPIO interrupt and the QuadDecoder interrupt</description>
			<value>16</value>
		</interrupt
		><interrupt>
			<name>PCM</name>
			<description>PCM interrupt</description>
			<value>17</value>
		</interrupt>
		<interrupt>
			<name>SRC_IN</name>
			<description>Sample rate converter input interrupt</description>
			<value>18</value>
		</interrupt>
		<interrupt>
			<name>SRC_OUT</name>
			<description>Sample rate converter output interrupt</description>
			<value>19</value>
		</interrupt>
		<interrupt>
			<name>DMA</name>
			<description>DMA interrupt</description>
			<value>20</value>
		</interrupt>

</peripheral></peripherals>
</device>
